lsbm-load.txt
Keys:       16 bytes each
Values:     1024 bytes each (1024 bytes after compression)
Entries:    10485760
RawSize:    10400.0 MB (estimated)
FileSize:   10400.0 MB (estimated)
------------------------------------------------
initiating writer......
writeop: finishd 200020 ops out of 200020, timepassed: 1 writecursor: 200020
writeop: finishd 109090 ops out of 309110, timepassed: 2 writecursor: 309110
writeop: finishd 123640 ops out of 432750, timepassed: 3 writecursor: 432750
writeop: finishd 120200 ops out of 552950, timepassed: 4 writecursor: 552950
writeop: finishd 3440 ops out of 556390, timepassed: 5 writecursor: 556390
writeop: finishd 119120 ops out of 675510, timepassed: 6 writecursor: 675510
writeop: finishd 4520 ops out of 680030, timepassed: 7 writecursor: 680030
writeop: finishd 25130 ops out of 705160, timepassed: 8 writecursor: 705160
writeop: finishd 98510 ops out of 803670, timepassed: 10 writecursor: 803670
writeop: finishd 61820 ops out of 865490, timepassed: 11 writecursor: 865490
writeop: finishd 61820 ops out of 927310, timepassed: 14 writecursor: 927310
writeop: finishd 123640 ops out of 1050950, timepassed: 17 writecursor: 1050950
writeop: finishd 67370 ops out of 1118320, timepassed: 18 writecursor: 1118320
writeop: finishd 56270 ops out of 1174590, timepassed: 21 writecursor: 1174590
writeop: finishd 24410 ops out of 1199000, timepassed: 22 writecursor: 1199000
writeop: finishd 99230 ops out of 1298230, timepassed: 26 writecursor: 1298230
writeop: finishd 54020 ops out of 1352250, timepassed: 27 writecursor: 1352250
writeop: finishd 69620 ops out of 1421870, timepassed: 31 writecursor: 1421870
writeop: finishd 123640 ops out of 1545510, timepassed: 32 writecursor: 1545510
writeop: finishd 123640 ops out of 1669150, timepassed: 34 writecursor: 1669150
writeop: finishd 123640 ops out of 1792790, timepassed: 37 writecursor: 1792790
writeop: finishd 123640 ops out of 1916430, timepassed: 40 writecursor: 1916430
writeop: finishd 110940 ops out of 2027370, timepassed: 41 writecursor: 2027370
writeop: finishd 12700 ops out of 2040070, timepassed: 44 writecursor: 2040070
writeop: finishd 95900 ops out of 2135970, timepassed: 45 writecursor: 2135970
writeop: finishd 27740 ops out of 2163710, timepassed: 49 writecursor: 2163710
writeop: finishd 123640 ops out of 2287350, timepassed: 54 writecursor: 2287350
writeop: finishd 123640 ops out of 2410990, timepassed: 59 writecursor: 2410990
writeop: finishd 48360 ops out of 2459350, timepassed: 60 writecursor: 2459350
writeop: finishd 75280 ops out of 2534630, timepassed: 66 writecursor: 2534630
writeop: finishd 123640 ops out of 2658270, timepassed: 69 writecursor: 2658270
writeop: finishd 123640 ops out of 2781910, timepassed: 73 writecursor: 2781910
writeop: finishd 30490 ops out of 2812400, timepassed: 74 writecursor: 2812400
writeop: finishd 93150 ops out of 2905550, timepassed: 78 writecursor: 2905550
writeop: finishd 56153 ops out of 2961703, timepassed: 79 writecursor: 2961703
writeop: finishd 67487 ops out of 3029190, timepassed: 84 writecursor: 3029190
writeop: finishd 123240 ops out of 3152430, timepassed: 85 writecursor: 3152430
writeop: finishd 400 ops out of 3152830, timepassed: 90 writecursor: 3152830
writeop: finishd 118856 ops out of 3271686, timepassed: 91 writecursor: 3271686
writeop: finishd 4784 ops out of 3276470, timepassed: 96 writecursor: 3276470
writeop: finishd 118060 ops out of 3394530, timepassed: 97 writecursor: 3394530
writeop: finishd 5580 ops out of 3400110, timepassed: 102 writecursor: 3400110
writeop: finishd 26410 ops out of 3426520, timepassed: 103 writecursor: 3426520
writeop: finishd 97230 ops out of 3523750, timepassed: 109 writecursor: 3523750
writeop: finishd 20240 ops out of 3543990, timepassed: 110 writecursor: 3543990
writeop: finishd 103400 ops out of 3647390, timepassed: 117 writecursor: 3647390
writeop: finishd 123640 ops out of 3771030, timepassed: 121 writecursor: 3771030
writeop: finishd 61820 ops out of 3832850, timepassed: 122 writecursor: 3832850
writeop: finishd 61820 ops out of 3894670, timepassed: 126 writecursor: 3894670
writeop: finishd 61820 ops out of 3956490, timepassed: 127 writecursor: 3956490
writeop: finishd 61820 ops out of 4018310, timepassed: 131 writecursor: 4018310
writeop: finishd 35660 ops out of 4053970, timepassed: 132 writecursor: 4053970
writeop: finishd 87980 ops out of 4141950, timepassed: 137 writecursor: 4141950
writeop: finishd 83070 ops out of 4225020, timepassed: 138 writecursor: 4225020
writeop: finishd 40570 ops out of 4265590, timepassed: 143 writecursor: 4265590
writeop: finishd 12690 ops out of 4278280, timepassed: 144 writecursor: 4278280
writeop: finishd 110950 ops out of 4389230, timepassed: 150 writecursor: 4389230
writeop: finishd 61820 ops out of 4451050, timepassed: 151 writecursor: 4451050
writeop: finishd 61820 ops out of 4512870, timepassed: 157 writecursor: 4512870
writeop: finishd 530 ops out of 4513400, timepassed: 158 writecursor: 4513400
writeop: finishd 123110 ops out of 4636510, timepassed: 165 writecursor: 4636510
writeop: finishd 60810 ops out of 4697320, timepassed: 166 writecursor: 4697320
writeop: finishd 62830 ops out of 4760150, timepassed: 173 writecursor: 4760150
writeop: finishd 12910 ops out of 4773060, timepassed: 174 writecursor: 4773060
writeop: finishd 110730 ops out of 4883790, timepassed: 178 writecursor: 4883790
writeop: finishd 1950 ops out of 4885740, timepassed: 179 writecursor: 4885740
writeop: finishd 121690 ops out of 5007430, timepassed: 185 writecursor: 5007430
writeop: finishd 123640 ops out of 5131070, timepassed: 191 writecursor: 5131070
writeop: finishd 123640 ops out of 5254710, timepassed: 197 writecursor: 5254710
writeop: finishd 92300 ops out of 5347010, timepassed: 198 writecursor: 5347010
writeop: finishd 31340 ops out of 5378350, timepassed: 204 writecursor: 5378350
writeop: finishd 16330 ops out of 5394680, timepassed: 205 writecursor: 5394680
writeop: finishd 107310 ops out of 5501990, timepassed: 212 writecursor: 5501990
writeop: finishd 61820 ops out of 5563810, timepassed: 213 writecursor: 5563810
writeop: finishd 61820 ops out of 5625630, timepassed: 221 writecursor: 5625630
writeop: finishd 123640 ops out of 5749270, timepassed: 230 writecursor: 5749270
writeop: finishd 123640 ops out of 5872910, timepassed: 239 writecursor: 5872910
writeop: finishd 94521 ops out of 5967431, timepassed: 240 writecursor: 5967431
writeop: finishd 29119 ops out of 5996550, timepassed: 245 writecursor: 5996550
writeop: finishd 118110 ops out of 6114660, timepassed: 246 writecursor: 6114660
writeop: finishd 5530 ops out of 6120190, timepassed: 252 writecursor: 6120190
writeop: finishd 123640 ops out of 6243830, timepassed: 258 writecursor: 6243830
writeop: finishd 12330 ops out of 6256160, timepassed: 259 writecursor: 6256160
writeop: finishd 111310 ops out of 6367470, timepassed: 266 writecursor: 6367470
writeop: finishd 120040 ops out of 6487510, timepassed: 267 writecursor: 6487510
writeop: finishd 3600 ops out of 6491110, timepassed: 274 writecursor: 6491110
writeop: finishd 56880 ops out of 6547990, timepassed: 275 writecursor: 6547990
writeop: finishd 66760 ops out of 6614750, timepassed: 283 writecursor: 6614750
writeop: finishd 110710 ops out of 6725460, timepassed: 284 writecursor: 6725460
writeop: finishd 12930 ops out of 6738390, timepassed: 292 writecursor: 6738390
writeop: finishd 71090 ops out of 6809480, timepassed: 293 writecursor: 6809480
writeop: finishd 52550 ops out of 6862030, timepassed: 302 writecursor: 6862030
writeop: finishd 79610 ops out of 6941640, timepassed: 303 writecursor: 6941640
writeop: finishd 44030 ops out of 6985670, timepassed: 312 writecursor: 6985670
writeop: finishd 58240 ops out of 7043910, timepassed: 313 writecursor: 7043910
writeop: finishd 65400 ops out of 7109310, timepassed: 318 writecursor: 7109310
writeop: finishd 61820 ops out of 7171130, timepassed: 319 writecursor: 7171130
writeop: finishd 61820 ops out of 7232950, timepassed: 326 writecursor: 7232950
writeop: finishd 123640 ops out of 7356590, timepassed: 333 writecursor: 7356590
writeop: finishd 9210 ops out of 7365800, timepassed: 334 writecursor: 7365800
writeop: finishd 114430 ops out of 7480230, timepassed: 342 writecursor: 7480230
writeop: finishd 123640 ops out of 7603870, timepassed: 351 writecursor: 7603870
writeop: finishd 101820 ops out of 7705690, timepassed: 352 writecursor: 7705690
writeop: finishd 21820 ops out of 7727510, timepassed: 360 writecursor: 7727510
writeop: finishd 21420 ops out of 7748930, timepassed: 361 writecursor: 7748930
writeop: finishd 102220 ops out of 7851150, timepassed: 370 writecursor: 7851150
writeop: finishd 18240 ops out of 7869390, timepassed: 371 writecursor: 7869390
writeop: finishd 105400 ops out of 7974790, timepassed: 381 writecursor: 7974790
writeop: finishd 61820 ops out of 8036610, timepassed: 382 writecursor: 8036610
writeop: finishd 61820 ops out of 8098430, timepassed: 392 writecursor: 8098430
writeop: finishd 61820 ops out of 8160250, timepassed: 393 writecursor: 8160250
writeop: finishd 61820 ops out of 8222070, timepassed: 400 writecursor: 8222070
writeop: finishd 123640 ops out of 8345710, timepassed: 408 writecursor: 8345710
writeop: finishd 61820 ops out of 8407530, timepassed: 409 writecursor: 8407530
writeop: finishd 61820 ops out of 8469350, timepassed: 417 writecursor: 8469350
writeop: finishd 123640 ops out of 8592990, timepassed: 426 writecursor: 8592990
writeop: finishd 61820 ops out of 8654810, timepassed: 427 writecursor: 8654810
writeop: finishd 61820 ops out of 8716630, timepassed: 436 writecursor: 8716630
writeop: finishd 48960 ops out of 8765590, timepassed: 437 writecursor: 8765590
writeop: finishd 74680 ops out of 8840270, timepassed: 447 writecursor: 8840270
writeop: finishd 123640 ops out of 8963910, timepassed: 457 writecursor: 8963910
writeop: finishd 1010 ops out of 8964920, timepassed: 458 writecursor: 8964920
writeop: finishd 122630 ops out of 9087550, timepassed: 469 writecursor: 9087550
writeop: finishd 61310 ops out of 9148860, timepassed: 470 writecursor: 9148860
writeop: finishd 62330 ops out of 9211190, timepassed: 481 writecursor: 9211190
writeop: finishd 38000 ops out of 9249190, timepassed: 482 writecursor: 9249190
writeop: finishd 85640 ops out of 9334830, timepassed: 490 writecursor: 9334830
writeop: finishd 123640 ops out of 9458470, timepassed: 499 writecursor: 9458470
writeop: finishd 14490 ops out of 9472960, timepassed: 500 writecursor: 9472960
writeop: finishd 109150 ops out of 9582110, timepassed: 509 writecursor: 9582110
writeop: finishd 108380 ops out of 9690490, timepassed: 510 writecursor: 9690490
writeop: finishd 15260 ops out of 9705750, timepassed: 519 writecursor: 9705750
writeop: finishd 65350 ops out of 9771100, timepassed: 520 writecursor: 9771100
writeop: finishd 58290 ops out of 9829390, timepassed: 530 writecursor: 9829390
writeop: finishd 61820 ops out of 9891210, timepassed: 531 writecursor: 9891210
writeop: finishd 61820 ops out of 9953030, timepassed: 541 writecursor: 9953030
writeop: finishd 41800 ops out of 9994830, timepassed: 542 writecursor: 9994830
writeop: finishd 81840 ops out of 10076670, timepassed: 553 writecursor: 10076670
writeop: finishd 81570 ops out of 10158240, timepassed: 554 writecursor: 10158240
writeop: finishd 42070 ops out of 10200310, timepassed: 566 writecursor: 10200310
writeop: finishd 123640 ops out of 10323950, timepassed: 579 writecursor: 10323950
writeop: finishd 105730 ops out of 10429680, timepassed: 580 writecursor: 10429680
writeop: finishd 17910 ops out of 10447590, timepassed: 588 writecursor: 10447590
completes 10485760 write ops in 588.000 seconds
separate     :      56.193 micros/op;	  17795.876 ops/s   17.8 MB/s
Microseconds per op:
Count: 10485760  Average: 56.1922  StdDev: 19871.37
Min: 0.0000  Median: 0.8510  Max: 12222011.0000
------------------------------------------------------
[       0,       1 ) 6160906  58.755%  58.755% ############
[       1,       2 ) 3242747  30.925%  89.680% ######
[       2,       3 )   16317   0.156%  89.836% 
[       3,       4 )    4286   0.041%  89.877% 
[       4,       5 )    1327   0.013%  89.889% 
[       5,       6 )    1705   0.016%  89.906% 
[       6,       7 )    2641   0.025%  89.931% 
[       7,       8 )    1403   0.013%  89.944% 
[       8,       9 )     402   0.004%  89.948% 
[       9,      10 )    1792   0.017%  89.965% 
[      10,      12 )    2393   0.023%  89.988% 
[      12,      14 )     512   0.005%  89.993% 
[      14,      16 )     213   0.002%  89.995% 
[      16,      18 )     159   0.002%  89.996% 
[      18,      20 )      98   0.001%  89.997% 
[      20,      25 )     704   0.007%  90.004% 
[      25,      30 )   81044   0.773%  90.777% 
[      30,      35 )  517520   4.935%  95.712% #
[      35,      40 )  310005   2.956%  98.669% #
[      40,      45 )   57830   0.552%  99.220% 
[      45,      50 )   20598   0.196%  99.417% 
[      50,      60 )   24869   0.237%  99.654% 
[      60,      70 )   10626   0.101%  99.755% 
[      70,      80 )   15824   0.151%  99.906% 
[      80,      90 )    5378   0.051%  99.957% 
[      90,     100 )    1527   0.015%  99.972% 
[     100,     120 )     876   0.008%  99.980% 
[     120,     140 )     411   0.004%  99.984% 
[     140,     160 )     117   0.001%  99.985% 
[     160,     180 )      48   0.000%  99.986% 
[     180,     200 )      20   0.000%  99.986% 
[     200,     250 )      39   0.000%  99.986% 
[     250,     300 )       6   0.000%  99.986% 
[     300,     350 )      17   0.000%  99.987% 
[     350,     400 )      12   0.000%  99.987% 
[     400,     450 )       8   0.000%  99.987% 
[     450,     500 )      11   0.000%  99.987% 
[     500,     600 )       7   0.000%  99.987% 
[     600,     700 )       2   0.000%  99.987% 
[     700,     800 )       3   0.000%  99.987% 
[     800,     900 )       2   0.000%  99.987% 
[    1000,    1200 )    1127   0.011%  99.998% 
[    1200,    1400 )       6   0.000%  99.998% 
[    1400,    1600 )       2   0.000%  99.998% 
[    1600,    1800 )       4   0.000%  99.998% 
[    1800,    2000 )       1   0.000%  99.998% 
[    2000,    2500 )       1   0.000%  99.998% 
[    3000,    3500 )       1   0.000%  99.998% 
[    3500,    4000 )       2   0.000%  99.998% 
[    4000,    4500 )       4   0.000%  99.998% 
[    4500,    5000 )       4   0.000%  99.998% 
[    5000,    6000 )       2   0.000%  99.998% 
[    6000,    7000 )       1   0.000%  99.998% 
[   14000,   16000 )       3   0.000%  99.998% 
[   16000,   18000 )       2   0.000%  99.998% 
[   18000,   20000 )       1   0.000%  99.998% 
[   20000,   25000 )       2   0.000%  99.998% 
[   25000,   30000 )       2   0.000%  99.998% 
[   30000,   35000 )       5   0.000%  99.998% 
[   35000,   40000 )       4   0.000%  99.998% 
[   40000,   45000 )       4   0.000%  99.998% 
[   45000,   50000 )       2   0.000%  99.998% 
[   50000,   60000 )       6   0.000%  99.998% 
[   60000,   70000 )      15   0.000%  99.999% 
[   70000,   80000 )       4   0.000%  99.999% 
[   80000,   90000 )      12   0.000%  99.999% 
[   90000,  100000 )      10   0.000%  99.999% 
[  100000,  120000 )      19   0.000%  99.999% 
[  120000,  140000 )      15   0.000%  99.999% 
[  140000,  160000 )       6   0.000%  99.999% 
[  160000,  180000 )       2   0.000%  99.999% 
[  200000,  250000 )       1   0.000%  99.999% 
[  250000,  300000 )       1   0.000%  99.999% 
[  450000,  500000 )       1   0.000%  99.999% 
[  500000,  600000 )       1   0.000%  99.999% 
[  600000,  700000 )       1   0.000%  99.999% 
[  700000,  800000 )       1   0.000%  99.999% 
[ 1000000, 1200000 )       1   0.000%  99.999% 
[ 1200000, 1400000 )       1   0.000%  99.999% 
[ 1600000, 1800000 )       1   0.000%  99.999% 
[ 2000000, 2500000 )       2   0.000%  99.999% 
[ 2500000, 3000000 )       3   0.000%  99.999% 
[ 3000000, 3500000 )       2   0.000%  99.999% 
[ 3500000, 4000000 )       5   0.000%  99.999% 
[ 4000000, 4500000 )       4   0.000%  99.999% 
[ 4500000, 5000000 )       4   0.000%  99.999% 
[ 5000000, 6000000 )      11   0.000% 100.000% 
[ 6000000, 7000000 )      10   0.000% 100.000% 
[ 7000000, 8000000 )       9   0.000% 100.000% 
[ 8000000, 9000000 )      10   0.000% 100.000% 
[ 9000000, 10000000 )       7   0.000% 100.000% 
[ 10000000, 12000000 )       8   0.000% 100.000% 
[ 12000000, 14000000 )       2   0.000% 100.000% 

Microseconds per WriteOp:
Count: 10485760  Average: 56.1321  StdDev: 19871.36
Min: 0.0000  Median: 0.7834  Max: 12222010.0000
------------------------------------------------------
[       0,       1 ) 6692087  63.821%  63.821% #############
[       1,       2 ) 2718090  25.922%  89.742% #####
[       2,       3 )   10784   0.103%  89.845% 
[       3,       4 )    3978   0.038%  89.883% 
[       4,       5 )     923   0.009%  89.892% 
[       5,       6 )    1817   0.017%  89.909% 
[       6,       7 )    2527   0.024%  89.933% 
[       7,       8 )    1245   0.012%  89.945% 
[       8,       9 )     410   0.004%  89.949% 
[       9,      10 )    2008   0.019%  89.968% 
[      10,      12 )    2142   0.020%  89.989% 
[      12,      14 )     475   0.005%  89.993% 
[      14,      16 )     199   0.002%  89.995% 
[      16,      18 )     145   0.001%  89.997% 
[      18,      20 )      87   0.001%  89.997% 
[      20,      25 )     773   0.007%  90.005% 
[      25,      30 )   85508   0.815%  90.820% 
[      30,      35 )  520989   4.969%  95.789% #
[      35,      40 )  303862   2.898%  98.687% #
[      40,      45 )   56549   0.539%  99.226% 
[      45,      50 )   20555   0.196%  99.422% 
[      50,      60 )   24471   0.233%  99.655% 
[      60,      70 )   10870   0.104%  99.759% 
[      70,      80 )   15701   0.150%  99.909% 
[      80,      90 )    5177   0.049%  99.958% 
[      90,     100 )    1478   0.014%  99.972% 
[     100,     120 )     861   0.008%  99.980% 
[     120,     140 )     405   0.004%  99.984% 
[     140,     160 )     115   0.001%  99.985% 
[     160,     180 )      47   0.000%  99.986% 
[     180,     200 )      20   0.000%  99.986% 
[     200,     250 )      39   0.000%  99.986% 
[     250,     300 )       6   0.000%  99.986% 
[     300,     350 )      17   0.000%  99.987% 
[     350,     400 )      12   0.000%  99.987% 
[     400,     450 )       8   0.000%  99.987% 
[     450,     500 )      11   0.000%  99.987% 
[     500,     600 )       7   0.000%  99.987% 
[     600,     700 )       2   0.000%  99.987% 
[     700,     800 )       3   0.000%  99.987% 
[     800,     900 )       2   0.000%  99.987% 
[    1000,    1200 )    1127   0.011%  99.998% 
[    1200,    1400 )       6   0.000%  99.998% 
[    1400,    1600 )       2   0.000%  99.998% 
[    1600,    1800 )       4   0.000%  99.998% 
[    1800,    2000 )       1   0.000%  99.998% 
[    2000,    2500 )       1   0.000%  99.998% 
[    3000,    3500 )       1   0.000%  99.998% 
[    3500,    4000 )       2   0.000%  99.998% 
[    4000,    4500 )       4   0.000%  99.998% 
[    4500,    5000 )       4   0.000%  99.998% 
[    5000,    6000 )       2   0.000%  99.998% 
[    6000,    7000 )       1   0.000%  99.998% 
[   14000,   16000 )       3   0.000%  99.998% 
[   16000,   18000 )       2   0.000%  99.998% 
[   18000,   20000 )       1   0.000%  99.998% 
[   20000,   25000 )       2   0.000%  99.998% 
[   25000,   30000 )       2   0.000%  99.998% 
[   30000,   35000 )       5   0.000%  99.998% 
[   35000,   40000 )       4   0.000%  99.998% 
[   40000,   45000 )       4   0.000%  99.998% 
[   45000,   50000 )       2   0.000%  99.998% 
[   50000,   60000 )       6   0.000%  99.998% 
[   60000,   70000 )      15   0.000%  99.999% 
[   70000,   80000 )       4   0.000%  99.999% 
[   80000,   90000 )      12   0.000%  99.999% 
[   90000,  100000 )      10   0.000%  99.999% 
[  100000,  120000 )      19   0.000%  99.999% 
[  120000,  140000 )      15   0.000%  99.999% 
[  140000,  160000 )       6   0.000%  99.999% 
[  160000,  180000 )       2   0.000%  99.999% 
[  200000,  250000 )       1   0.000%  99.999% 
[  250000,  300000 )       1   0.000%  99.999% 
[  450000,  500000 )       1   0.000%  99.999% 
[  500000,  600000 )       1   0.000%  99.999% 
[  600000,  700000 )       1   0.000%  99.999% 
[  700000,  800000 )       1   0.000%  99.999% 
[ 1000000, 1200000 )       1   0.000%  99.999% 
[ 1200000, 1400000 )       1   0.000%  99.999% 
[ 1600000, 1800000 )       1   0.000%  99.999% 
[ 2000000, 2500000 )       2   0.000%  99.999% 
[ 2500000, 3000000 )       3   0.000%  99.999% 
[ 3000000, 3500000 )       2   0.000%  99.999% 
[ 3500000, 4000000 )       5   0.000%  99.999% 
[ 4000000, 4500000 )       4   0.000%  99.999% 
[ 4500000, 5000000 )       4   0.000%  99.999% 
[ 5000000, 6000000 )      11   0.000% 100.000% 
[ 6000000, 7000000 )      10   0.000% 100.000% 
[ 7000000, 8000000 )       9   0.000% 100.000% 
[ 8000000, 9000000 )      10   0.000% 100.000% 
[ 9000000, 10000000 )       7   0.000% 100.000% 
[ 10000000, 12000000 )       8   0.000% 100.000% 
[ 12000000, 14000000 )       2   0.000% 100.000%